lib/scripts/pls/DLA_high_load.yml
---
settings:
  env:
    BASE_URL: https://stage-rls.perchwell.com:6103/rets
    PASS: perchwell
    USER: helen
execution:
- concurrency: 50
  hold-for: 20m
  ramp-up: 250s
#  scenario: GetObject,Search_average-high_traffic,Search_large-high_traffic,Search_small-high_traffic,Update_high      
scenarios:
  GetObject:
    authorization:
      list:
      - mechanism: DIGEST
        name: ${USER}
        password: ${PASS}
        realm: RETS Server
        url: ${BASE_URL}
    headers:
      Content-Type: application/x-www-form-urlencoded
      RETS-Version: RETS/1.7
    requests:
    - body: "{\r\n\t\"IDs\":[\"0000-0001-7155-4339\"]\r\n}\r\n"
      follow-redirects: true
      label: GetObject Login
      method: GET
      url: ${BASE_URL}/login
    - assert:
      - assume-success: false
        contains:
        - Content-Type
        - Content-ID
        not: false
        regexp: false
        subject: body
      body:
        ID: CORC-2908870:*
        Resource: Listing
        Type: Photo
      follow-redirects: true
      label: GetObject high Photo *
      method: POST
      url: ${BASE_URL}/getObject
    - assert:
      - assume-success: false
        contains:
        - image/jpeg
        not: false
        regexp: false
        subject: headers
      body:
        ID: CORC-2908870:1
        Resource: Listing
        Type: Photo
      follow-redirects: true
      label: GetObject high Photo 1
      method: POST
      url: ${BASE_URL}/getObject
    - assert:
      - assume-success: false
        contains:
        - 'Location:'
        - <RETS ReplyCode="0" ReplyText="Operation Successful"/>
        not: false
        regexp: false
        subject: body
      body:
        ID: CORC-2908870:*
        Location: '1'
        Resource: Listing
        Type: Photo
      follow-redirects: true
      label: GetObject Photo * & Location
      method: POST
      url: ${BASE_URL}/getObject
    - assert:
      - assume-success: false
        contains:
        - 'Location:'
        - <RETS ReplyCode="0" ReplyText="Operation Successful"/>
        regexp: false
        subject: body
      body:
        ID: PDES-933454:1
        Location: '1'
        Resource: Listing
        Type: FloorPlan
      follow-redirects: true
      label: GetObject FloorPlan 1 & Location
      method: POST
      url: ${BASE_URL}/getObject
    - assert:
      - assume-success: false
        contains:
        - 'Content-ID: RPLU-63212600062'
        - Content-Type
        not: false
        regexp: false
        subject: body
      body:
        ID: RPLU-63212600062:*
        Location: '1'
        Resource: Listing
        Type: Video
      follow-redirects: true
      label: GetObject Video 1 & Location
      method: POST
      url: ${BASE_URL}/getObject
    store-cache: true
    store-cookie: true
    use-dns-cache-mgr: false
  Search_average-high_traffic:
    authorization:
      list:
      - mechanism: DIGEST
        name: ${USER}
        password: ${PASS}
        realm: RETS Server
        url: ${BASE_URL}
    headers:
      Content-Type: application/x-www-form-urlencoded
      RETS-Version: RETS/1.7
    requests:
    - body: "{\r\n\t\"IDs\":[\"0000-0001-7155-4339\"]\r\n}\r\n"
      follow-redirects: true
      label: Search_average Login
      method: GET
      url: ${BASE_URL}/login
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: Search average (ListingID=CORC-3479098) in OpenHouse
      method: GET
      url: ${BASE_URL}/search?Query=(ListingID=CORC-3479098)&QueryType=DMQL2&SearchType=OpenHouse&Class=OpenHouse&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        Query: '%28ModifiedDateTime%3D2020-03-30-%29%2C%28%28ProviderID%3DCORC%29%7C%28ListingStatus%3D%7CActive%2C%22Contract%20Signed%22%2C%22TOM%2030%20Days%22%29%29%2C%28DeletedYN%3D%7C0%29'
      follow-redirects: true
      label: Search average in UnitSale
      method: GET
      url: ${BASE_URL}/search?QueryType=DMQL2&SearchType=Listing&Class=UnitSale&Format=COMPACT&Count=1&Limit=10000
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: Search average (ListingID=OLRS-1462289) in UnitSale
      method: GET
      url: ${BASE_URL}/search?Query=(ListingID=OLRS-1462289)&QueryType=DMQL2&SearchType=Listing&Class=UnitSale&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        Query: ((CreatedDateTime=TODAY-),(DeletedYN=|1,0),(ResourceID=Listing))|((ResourceID=Building),(SortOrder=0+),(PublicURL=*http*))
      follow-redirects: true
      label: Search average in OBJECT
      method: GET
      url: ${BASE_URL}/search?QueryType=DMQL2&SearchType=Object&Class=Object&Format=COMPACT&Count=1&Limit=10000
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: Search average (KeyFieldValue%3DRPLU-63212658261) in Object
      method: GET
      url: ${BASE_URL}/search?Query=(KeyFieldValue%3DRPLU-63212658261)&QueryType=DMQL2&SearchType=Object&Class=Object&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        Query: '%28ProviderID%3DCORC%29%7C%28ProviderID%3DPRCH%29%2C%28%28LotSizeAcres%3D0%252B%29%2C%28City%3D%2Aa%2A%29%29%2C%28Class%3DCondoCoop%29'
      follow-redirects: true
      label: Search average in CondoCoop
      method: GET
      url: ${BASE_URL}/search?QueryType=DMQL2&SearchType=Building&Class=CondoCoop&Format=COMPACT&Count=1&Limit=10000
    store-cache: true
    store-cookie: true
    use-dns-cache-mgr: false
  Search_large-high_traffic:
    authorization:
      list:
      - mechanism: DIGEST
        name: ${USER}
        password: ${PASS}
        realm: RETS Server
        url: ${BASE_URL}
    headers:
      Content-Type: application/x-www-form-urlencoded
      RETS-Version: RETS/1.7
    requests:
    - body: "{\r\n\t\"IDs\":[\"0000-0001-7155-4339\"]\r\n}\r\n"
      follow-redirects: true
      label: Search large Login
      method: GET
      url: ${BASE_URL}/login
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        Query: '%28ModifiedDateTime%3D2020-03-30-%29%2C%28%28ProviderID%3DCORC%29%7C%28ListingStatus%3D%7CActive%2C%22Contract%20Signed%22%2C%22TOM%2030%20Days%22%29%29%2C%28DeletedYN%3D%7C0%29'
      follow-redirects: true
      label: Search large in UnitSale
      method: GET
      url: ${BASE_URL}/search?QueryType=DMQL2&SearchType=Listing&Class=UnitSale&Format=COMPACT&Count=1&Limit=10000
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        Query: (ProviderID=**),((PostalCode=1*)|(PostalCode=2*)|(PostalCode=3*)),((CompanyID=PRCH*)|(CompanyID=**),(DeletedYN=.ANY.))
      follow-redirects: true
      label: Search large in COMPANY
      method: GET
      url: ${BASE_URL}/search?QueryType=DMQL2&SearchType=Company&Class=Company&Format=COMPACT&Count=1&Limit=10000
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        Query: ((CreatedDateTime=TODAY-),(DeletedYN=|1,0),(ResourceID=Listing))|((ResourceID=Building),(SortOrder=0+),(PublicURL=*http*))
      follow-redirects: true
      label: Search large in OBJECT
      method: GET
      url: ${BASE_URL}/search?QueryType=DMQL2&SearchType=Object&Class=Object&Format=COMPACT&Count=1&Limit=10000
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        Query: '%28ProviderID%3D%2A%2A%29%2C%28BedsTotal%3D0%252B%29%2C%28CreatedDateTime%3D2016-01-01-2020-03-30%29%2C%28%28KitchenCondition%3D%7CNew%2CExcellent%2CGood%29%7C%28KitchenCondition%3D%7CFair%2CPoor%2CWrecked%29%29'
      follow-redirects: true
      label: Search large in Unit
      method: GET
      url: ${BASE_URL}/search?QueryType=DMQL2&SearchType=Unit&Class=Unit&Format=COMPACT&Count=1&Limit=10000
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        Query: '%28ProviderID%3DCORC%29%7C%28ProviderID%3DPRCH%29%2C%28%28LotSizeAcres%3D0%252B%29%2C%28City%3D%2Aa%2A%29%29%2C%28Class%3DCondoCoop%29'
      follow-redirects: true
      label: Search large in CondoCoop
      method: GET
      url: ${BASE_URL}/search?QueryType=DMQL2&SearchType=Building&Class=CondoCoop&Format=COMPACT&Count=1&Limit=10000
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        Query: (AgentID=**),((BrokerOnlyYN=1)|(ByAppointmentOnlyYN=1)),(FromDateTime=2018-01-01+),(ToDateTime=2020-03-01-2020-06-01),(DeletedYN=.ANY.)
      follow-redirects: true
      label: Search large in OpenHouse
      method: GET
      url: ${BASE_URL}/search?QueryType=DMQL2&SearchType=OpenHouse&Class=OpenHouse&Format=COMPACT&Count=1&Limit=10000
    store-cache: true
    store-cookie: true
    use-dns-cache-mgr: false
  Search_small-high_traffic:
    authorization:
      list:
      - mechanism: DIGEST
        name: ${USER}
        password: ${PASS}
        realm: RETS Server
        url: ${BASE_URL}
    headers:
      Content-Type: application/x-www-form-urlencoded
      RETS-Version: RETS/1.7
    requests:
    - body: "{\r\n\t\"IDs\":[\"0000-0001-7155-4339\"]\r\n}\r\n"
      follow-redirects: true
      label: Search_small Login
      method: GET
      url: ${BASE_URL}/login
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: (ProviderID=CORC) in UnitSale
      method: GET
      url: ${BASE_URL}/search?Query=(ProviderID=CORC)&QueryType=DMQL2&SearchType=Listing&Class=UnitSale&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: (UnitHasWasherDryerYN=1) in Unit
      method: GET
      url: ${BASE_URL}/search?Query=(UnitHasWasherDryerYN=1)&QueryType=DMQL2&SearchType=Unit&Class=Unit&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: (KeyFieldValue=BMAR-102128) in History
      method: GET
      url: ${BASE_URL}/search?Query=(KeyFieldValue=BMAR-102128)&QueryType=DMQL2&SearchType=History&Class=History&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: (BuildingID=CORC-106284) in Townhouse
      method: GET
      url: ${BASE_URL}/search?Query=(BuildingID=CORC-106284)&QueryType=DMQL2&SearchType=Building&Class=Townhouse&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: (KeyFieldValue%3DRPLU-63212658261) in Object
      method: GET
      url: ${BASE_URL}/search?Query=(KeyFieldValue%3DRPLU-63212658261)&QueryType=DMQL2&SearchType=Object&Class=Object&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: (ListingID=OLRS-1462289) in UnitSale
      method: GET
      url: ${BASE_URL}/search?Query=(ListingID=OLRS-1462289)&QueryType=DMQL2&SearchType=Listing&Class=UnitSale&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: (ListingID=CORC-3479098) in OpenHouse
      method: GET
      url: ${BASE_URL}/search?Query=(ListingID=CORC-3479098)&QueryType=DMQL2&SearchType=OpenHouse&Class=OpenHouse&Format=COMPACT&Count=1&Limit=100
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      follow-redirects: true
      label: (BuildingID=CORC-106284) in OpenHouse
      method: GET
      url: ${BASE_URL}/search?Query=(BuildingID=CORC-106284)&QueryType=DMQL2&SearchType=Listing&Class=BuildingRent&Format=COMPACT&Count=1&Limit=100
    store-cache: true
    store-cookie: true
    use-dns-cache-mgr: false
  Update_high:
    authorization:
      list:
      - mechanism: DIGEST
        name: ${USER}
        password: ${PASS}
        realm: RETS Server
        url: ${BASE_URL}
    data-sources:
     - path: update_high_ids.csv
       delimiter: ';'
       quoted: false
       loop: true
       variable-names: uniqueID1,uniqueID2 
       random-order: false   
    headers:
      Content-Type: application/x-www-form-urlencoded
      RETS-Version: RETS/1.7
    requests:
    - body: "{\r\n\t\"IDs\":[\"0000-0001-7155-4339\"]\r\n}\r\n"
      follow-redirects: true
      label: Update high Login
      method: GET
      url: ${BASE_URL}/login
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: UnitSale
        Record: "ListingID=PRCH-${uniqueID1}\tListingKey=${uniqueID1}\tWebID=PRCH-${uniqueID1}\tListAgentID1=PRCH-51421\tListCompanyID1=PRCH-1180\tListPrice=3950000.00\tCoBrokeAgreement=Other\tListingType=Exclusive\tListingStatus=Active\tListDateTime=2020-04-02T08:00:00\tShowDateTime=2020-04-02T08:00:00\tExpirationDateTime=2020-03-10T00:00:00\tShowingInstructions=This rarely available 3-bedroom, 2.-bath awaits you in the Bromley condominium. The Bromley features resident only services that include a swimming pool and spa, health club, a mirrored aerobics/yoga/dance room, a basketball room\tVOWEntireListingDisplay=1\tVOWAddressDisplay=1\tVOWConsumerComment=1\tVOWAutomatedValuationDisplay=1\tIDXEntireListingDisplayYN=1\tSyndicationYN=1\tListingURL=http://corenyc.com/\tUnitID=PRCH-148358\tBuildingID=PRCH-148358\tMonthlyTaxAmount=0.00\tMaintCCAmount=0.00\tPercentOfCommonElements=14.00\tMaximumFinancingPercent=0.00\tNewDevelopmentYN=0\tCommissionAmount=850\tFlipTaxPercent=5.00"
        Resource: Listing
        Type: Add
      follow-redirects: true
      label: High Add UnitSale default fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: Apartment
        Record: "BuildingID=PRCH-${uniqueID1}\tBuildingKey=${uniqueID1}\tBuildingType=Elevator\tNumberOfUnitsTotal=6\tStoriesTotal=4\tElevatorsTotal=1\tStreetNumber=61\tStreetName=Broadway\tCity=New York\tStateOrProvince=NY\tCountry=USA\tPostalCode=10023\tCounty=New York\tBorough=Manhattan\tNeighborhood=Lincoln Square\tTaxBlock=0\tTaxLot=0\tGarageYN=0\tPetPolicy=Pets allowed\tWasherDryerAllowedYN=1\tLobbyAttendant=Yes\tLongitude=-73.59097\tLatitude=40.93765"
        Resource: Building
        Type: Add
      follow-redirects: true
      label: High Add Apartment default fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: OpenHouse
        Record: "OpenHouseID=PRCH-${uniqueID1}\tOpenHouseKey=${uniqueID1}\tListingID=PRCH-${uniqueID1}\tAgentID=PRCH-51421\tCompanyID=PRCH-1180\tBrokerOnlyYN=1\tByAppointmentOnlyYN=0\tCreatedDateTime=2020-04-02T08:00:00\tDeletedYN=0\tFromDateTime=2019-09-01T10:00:00\tModifiedDateTime=2020-04-02T08:00:00\tProviderID=PRCH\tRemarks=Remarks Remarks Remarks\tToDateTime=2020-04-02T08:00:00"
        Resource: OpenHouse
        Type: Add
      follow-redirects: true
      label: High Add OpenHouse all fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: Object
        Record: "ObjectID=PRCH-${uniqueID1}\tObjectKey=${uniqueID1}\tResourceID=Listing\tKeyFieldValue=PRCH-${uniqueID1}\tObjectType=Thumbnail\tSortOrder=5\tPublicURL=https://media.perchwell.com/property_images/pictures/001/001/891/original/open-uri20170201-6475-ytco91?1485967795\tCreatedDateTime=2020-04-02T08:00:00\tDeletedYN=0\tDescription=Description Description Description\tModifiedDateTime=2020-04-02T08:00:00\tName=Object Name\tPrivateURL=HTTPS://media.perchwell.com/property_images/pictures/001/001/891/original\tProviderID=PRCH"
        Resource: Object
        Type: Add
      follow-redirects: true
      label: High Add Object all fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: BuildingRent
        Record: "ListingID=PRCH-${uniqueID2}\tListingKey=${uniqueID2}\tWebID=PRCH-${uniqueID2}\tFurnished=No\tShowDateTime=2020-04-02T08:00:00\tExpirationDateTime=2020-09-01T08:00:00\tAvailableDateTime=2020-04-02T08:00:00\tBonusRemarks=Bonus Remarks\tBrokerToBrokerNotes=Broker To Broker Notes\tBuildingID=PRCH-6042\tClass=BuildingRent\tCloseDateTime=2020-05-10T00:00:00\tClosePrice=440000.00\tCoBrokeAgreement=RUNDBA\tCommissionAmount=1500.00\tCommissionRemarks=Commission Remarks\tConcessionRemarks=Concession Remarks\tCreatedDateTime=2020-04-02T08:00:00\tDeletedYN=0\tDeliveredVacantYN=1\tDepositAmount=44000.00\tDescription=Description\tExclusions=Exclusions\tFurnishedAvailableDateTime=2020-05-01T11:00:00\tFurnishedLeaseTermMonths=12\tFurnishedListPrice=46000.00\tFurnishedMaxLeaseMonths=12\tFurnishedMinLeaseMonths=5\tFurnishedRemarks=Furnished Remarks\tGuarantor=US\tInclusions=Inclusions\tLeaseTermMonths=6\tLeaseType=Non-stabilized sublease\tListAgentID1=PRCH-51421\tListAgentID2=PRCH-51421\tListAgentID3=PRCH-51421\tListAgentID4=PRCH-51421\tListCompanyID1=PRCH-1180\tListCompanyID2=PRCH-1180\tListCompanyID3=PRCH-1180\tListCompanyID4=PRCH-1180\tListDateTime=2020-04-02T08:00:00\tListingStatus=Expired\tListingType=Exclusive\tListPrice=4500000.00\tListingURL=http://www.corenyc.com\tManagingAgencyListingYN=0\tMaxLeaseMonths=3\tMinLeaseMonths=10\tModifiedDateTime=2020-04-02T08:00:00\tOriginalListPrice=460000.00\tOwnerPaysRemarks=Owner Pays Remarks\tOwnerPaysToCoBrokerYN=1\tProviderID=PRCH\tShowAgentID=PRCH-51421\tShowCompanyID=PRCH-1180\tShowingInstructions=ShowingI nstructions\tSocialMedia1=http://www.corenyc.com\tSocialMedia2=http://www.corenyc.com\tSocialMedia3=http://www.corenyc.com\tSocialMedia4=http://www.corenyc.com\tStatusChangeDateTime=2020-04-02T08:00:00\tUnfurnishedRemarks=Unfurnished Remarks\tUnitHasDishwasherYN=1\tVOWEntireListingDisplay=1\tVendorIgnoreUpdateYN=1\tVOWAddressDisplay=0\tVOWConsumerComment=0\tVOWAutomatedValuationDisplay=1\tIDXEntireListingDisplayYN=1\tSyndicationYN=1\tCommissionType=Co-broke\tLeaseTerm=One Year\tConcessionYN=0\tOwnerPaysPlusConcessionsYN=0\tBonusYN=0\tPetPolicy=No cats"
        Resource: Listing
        Type: AddOrChange
      follow-redirects: true
      label: High AddOrChange BuildingRent all fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: CondoCoop
        Record: "BuildingID=PRCH-${uniqueID2}\tBuildingKey=${uniqueID2}\tBuildingType=Elevator\tNumberOfUnitsTotal=3\tStoriesTotal=4\tElevatorsTotal=1\tStreetNumber=138\tStreetName=Broadway\tCity=Brooklyn\tStateOrProvince=NY\tCountry=USA\tPostalCode=11211\tCounty=Kings\tBorough=Brooklyn\tNeighborhood=Williamsburg\tTaxBlock=2\tTaxLot=1\tGarageYN=1\tPetPolicy=No pets\tOwnershipType=Condo\tWasherDryerAllowedYN=0\tLobbyAttendant=FullTime\tLongitude=-73.59097\tLatitude=40.93765\tProviderID=PRCH\tAccessibleApproachWithRampYN=1\tAccessibleElevatorInstalledYN=1\tAccessibleEntranceYN=0\tAccessibleStairsYN=1\tADACompliantYN=0\tAlternateStreetDirPrefix=St\tAlternateStreetDirSuffix=st\tAlternateStreetName=Yn\tAlternateStreetNumber=St\tAlternateStreetSuffix=ST\tArchitectName=Mc Mallow\tAreaOverFAR=456\tAreaUnderFAR=123\tArtistInResidenceAllowedYN=1\tBalconyYN=1\tBasementYN=0\tBikeStorageYN=0\tBoardRemarks=Board Remarks\tBuildingCoversUtilitiesYN=1\tBuildingName=Light\tCertificateOfOccupancyYN=1\tCommercialUnitsYN=0\tConcierge=Yes\tCorporateOwnerAllowedYN=1\tCourtyardYN=1\tCreatedDateTime=2020-04-02T08:00:00\tCrossStreet=CATHERINE LANE\tDeletedYN=0\tDoorman=No\tElevatorMan=FullTime\tExtensionLength=18\tFacadeType=Metal\tFARAsBuilt=240\tFitnessRoomYN=1\tFoundationArea=247\tGardenYN=1\tGeneralCondition=Excellent\tGeographicSection=2\tHealthClubYN=1\tLandmarkStatusYN=0\tLaundryRemarks=Laundry Remarks\tLaundryYN=0\tLength=180\tLiveWorkAllowedYN=1\tLivingArea=260\tLobbyAttendanceType=FullTime\tLotArea=240\tLotLength=184\tLotWidth=178\tMaxAllowedFAR=485\tModifiedDateTime=2020-04-02T08:00:00\tMortgageAmount=156\tMortgageDueYear=2011\tMortgageInterestPercent=18\tOccupiedProfessionalUnitsPercent=4\tOccupiedProfessionalUnitsTotal=2\tOccupiedRetailUnitsPercent=14\tOccupiedRetailUnitsTotal=4\tOccupiedUnitsPercent=21\tOccupiedUnitsTotal=7\tOriginalDetailYN=0\tPatioYN=1\tPenthouseYN=0\tPetsAllowedYN=1\tPiedATerreAllowedYN=0\tPoolYN=1\tPreWarYN=0\tProfessionalUnitsPercent=0.00\tProfessionalUnitsTotal=2\tRemarks=Remarks\tReserveFundAmount=452.5\tRetailUnitsPercent=6\tRetailUnitsTotal=2\tRoofDeckYN=1\tSecurityType=Buzzer\tSoldUnitsPercent=43\tSoldUnitsTotal=3\tStorageYN=1\tTaxAbatementExpiresYear=2013\tTaxAbatementRemarks=Tax Abatement Remarks\tTaxAbatementYN=1\tTerraceYN=0\tUnparsedAddress=Addr\tUnsoldUnitsPercent=24\tUnsoldUnitsTotal=3\tVacantUnitsPercent=45\tVacantUnitsTotal=5\tVirtualAttendant=No\tWheelchairAccessibleYN=1\tWidth=245\tYearBuilt=2010\tYearIncorporated=1\tYearRenovated=0\tZoning=Zoning"
        Resource: Building
        Type: AddOrChange
      follow-redirects: true
      label: High AddOrChange CondoCoop default fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: OpenHouse
        Record: "OpenHouseID=PRCH-${uniqueID1}\tOpenHouseKey=${uniqueID1}\tListingID=PRCH-${uniqueID2}\tAgentID=PRCH-51421\tCompanyID=PRCH-1180\tBrokerOnlyYN=1\tByAppointmentOnlyYN=1\tCreatedDateTime=2020-04-02T08:00:00\tDeletedYN=0\tFromDateTime=2019-09-01T12:00:00\tModifiedDateTime=2020-04-02T08:00:00\tProviderID=PRCH\tRemarks=Remarks\tToDateTime=2020-05-02T08:00:00"
        Resource: OpenHouse
        Type: AddOrChange
      follow-redirects: true
      label: Update AddOrChange OpenHouse all fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: Object
        Record: "ObjectID=PRCH-${uniqueID2}\tObjectKey=${uniqueID2}\tResourceID=Building\tKeyFieldValue=PRCH-${uniqueID2}\tObjectType=Photo\tSortOrder=12\tPublicURL=http://media.halstead.com/pictures/12600062-1.jpg"
        Resource: Object
        Type: AddOrChange
      follow-redirects: true
      label: High AddOrChange Object default fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: Object
        Record: "ObjectID=PRCH-${uniqueID1}\tObjectKey=${uniqueID1}\tResourceID=Listing\tKeyFieldValue=PRCH-${uniqueID1}\tObjectType=Photo\tSortOrder=4\tPublicURL=https://media.perchwell.com/property_images/pictures/001/001/891/original/open-uri20170201-6475-ytco91?1485967795\tCreatedDateTime=2020-04-02T08:00:00\tDeletedYN=0\tDescription=Description Description Description\tModifiedDateTime=2020-04-02T08:00:00\tName=Object Name\tPrivateURL=HTTPS://media.perchwell.com/property_images/pictures/001/001/891/original\tProviderID=PRCH"
        Resource: Object
        Type: AddOrChange
      follow-redirects: true
      label: High AddOrChange Object all fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: BuildingRent
        Record: "ListingID=PRCH-${uniqueID2}\tListingKey=${uniqueID2}\tWebID=PRCH-${uniqueID2}\tListAgentID1=PRCH-51421\tListCompanyID1=PRCH-1180\tListPrice=3950000.00\tCoBrokeAgreement=Other\tListingType=Exclusive\tListingStatus=Active\tListDateTime=2020-04-02T08:00:00\tShowDateTime=2020-04-02T08:00:00\tExpirationDateTime=2020-03-10T00:00:00\tShowingInstructions=This rarely available 3-bedroom, 2.-bath awaits you in the Bromley condominium.\tVOWEntireListingDisplay=1\tVOWAddressDisplay=1\tVOWConsumerComment=1\tVOWAutomatedValuationDisplay=1\tIDXEntireListingDisplayYN=1\tSyndicationYN=1\tListingURL=http://corenyc.com/\tUnitID=PRCH-148358\tBuildingID=PRCH-148358\tMonthlyTaxAmount=10.00\tMaintCCAmount=0.00\tPercentOfCommonElements=10.00\tMaximumFinancingPercent=5.00\tNewDevelopmentYN=0\tCommissionAmount=950\tFlipTaxPercent=4.00"
        Resource: Listing
        Type: Change
      follow-redirects: true
      label: High AddOrChange BuildingRent all fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: Apartment
        Record: "BuildingID=PRCH-${uniqueID1}\tBuildingKey=${uniqueID1}\tBuildingType=Elevator\tNumberOfUnitsTotal=4\tStoriesTotal=5\tElevatorsTotal=2\tStreetNumber=51\tStreetName=Broadway\tCity=New York\tStateOrProvince=NY\tCountry=USA\tPostalCode=10123\tCounty=New York\tBorough=Manhattan\tNeighborhood=Lincoln Square\tTaxBlock=0\tTaxLot=0\tGarageYN=1\tPetPolicy=Pets allowed\tWasherDryerAllowedYN=0\tLobbyAttendant=Yes\tLongitude=-73.59097\tLatitude=40.93765"
        Resource: Building
        Type: Change
      follow-redirects: true
      label: High Update Change Apartment default fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: OpenHouse
        Record: "OpenHouseID=PRCH-${uniqueID1}\tOpenHouseKey=${uniqueID1}\tListingID=PRCH-${uniqueID2}\tAgentID=PRCH-51421\tCompanyID=PRCH-1180\tBrokerOnlyYN=1\tByAppointmentOnlyYN=0\tCreatedDateTime=2020-04-02T08:00:00\tDeletedYN=0\tFromDateTime=2019-10-01T12:00:00\tModifiedDateTime=2020-04-02T08:00:00\tProviderID=PRCH\tRemarks=No comments\tToDateTime=2020-05-02T08:00:00"
        Resource: OpenHouse
        Type: Change
      follow-redirects: true
      label: High Change OpenHouse all fields
      method: POST
      url: ${BASE_URL}/update
    - assert:
      - assume-success: false
        contains:
        - ReplyCode="0" ReplyText="Operation Successful"
        not: false
        regexp: false
        subject: body
      body:
        ClassName: Object
        Record: "ObjectID=PRCH-${uniqueID1}\tObjectKey=${uniqueID1}\tResourceID=Listing\tKeyFieldValue=PRCH-${uniqueID2}\tObjectType=FloorPlan\tSortOrder=3\tPublicURL=https://media.perchwell.com/property_images/pictures/001/001/891/original/open-uri20170201-6475-ytco91?1485967795\tCreatedDateTime=2020-04-02T08:00:00\tDeletedYN=0\tDescription=Floorplan\tModifiedDateTime=2020-04-02T08:00:00\tName=Floorplan\tPrivateURL=https://media.perchwell.com/property_images/pictures/001/001/891/original\tProviderID=PRCH"
        Resource: Object
        Type: Change
      follow-redirects: true
      label: High Change Object all fields
      method: POST
      url: ${BASE_URL}/update
    store-cache: true
    store-cookie: true
    use-dns-cache-mgr: false  
reporting:
- module: console
- module: final-stats
  summary: true
  percentiles: true 
  failed-labels: false
  test-duration: true
  dump-csv: search_result_csv.csv
- module: blazemeter
  project: PLS
modules:
  local:
    sequential: true